$(document).ready(function(){
	// sync data ↓
	mp_data = {  // MP3 sync
		////////////
		// P - 10
		data_p122_01: { // 파일명 -
			subtitle: [ // 자막싱크([시작시간, 끝시간, 역할번호])
				[6.9,	9.5, 1],
				[9.7,	11.3, 2]
			],
			dialogue: [
				["I like this eraser. How much is it?", "이 지우개가 좋아요. 얼마예요?"],
				["It’s 500 won.", "500원이에요."]

			],
		},
		data_p122_02: { // 파일명 -
			subtitle: [ // 자막싱크([시작시간, 끝시간, 역할번호])
				[6.7,	8.1, 1],
				[8.5,	11.5, 2],
				[15.6,	17.2, 1],
				[20.7,	23.4, 2],
				[24.5,	26.5, 1]
			],
			dialogue: [
				["May I help you?", "도와드릴까요?"],
				["Yes, please. I’m looking for jeans.", "네. 저는 청바지를 찾고 있어요."],
				["How about these?", "이건 어떠세요?"],
				["I like them. How much are they?", "마음에 들어요. 얼마예요?"],
				["They’re 8,000 won.", "8,000원이에요."]
			],
		},
		data_122_s_16_a: { // 파일명 - Listen and Say(1)
			subtitle: [
				[0.4, 3.1, 1],
				[3.5, 5.1, 2]
			],
		},
		data_122_s_18_a: { // 파일명 - Listen and Say(2)
			subtitle: [
				[0.3, 1.7, 1],
				[2.2, 5.4, 2],
				[5.8, 7.4, 1],
				[7.8, 10.4, 2],
				[11.2, 13.0, 1]
			],
		},
		data_122_o_21_a: { // 파일명 - 학습목표(1)
			subtitle: [
				[0.3, 2.0, 1],
				[2.5, 6.0, 2]
			]
		},
		data_122_o_23_a: { // 파일명 - 학습목표(2)
			subtitle: [
				[0.4, 2.3, 1],
				[2.9, 5.1, 2]
			]
		},

		////////////
		// P - 11
		data_p123_01: { // 파일명 -
			subtitle: [ // 자막싱크([시작시간, 끝시간, 역할번호])
				[3.4, 5, 1],
				[5.1, 9.4, 2],
				[13.2, 14.6, 2],
				[15.7, 19, 3],
				[19.3, 22.6, 2],
				[25.7, 27.7, 1],
				[27.6, 31.4, 2],
				[33.6, 37.2, 2],
				[37.5, 39.3, 4],
				[40, 41.6, 2],
				[43.7, 47.7, 2],
				[48.3, 50.3, 4],
				[53.3, 55.0, 2],
				[55.2, 58.1, 3]
			],
			dialogue: [
				["May I help you?", "도와드릴까요?"],
				["Yes, please. I’m looking for a long dress.", "네. 저는 지금 긴 드레스를 찾고 있어요."],
				["I like purple.", "저는 보라색을 좋아해요."],
				["How pretty! You look great.", "너무 예쁘다! 멋져 보여."],
				["Thanks, Mom. How much is it?", "고마워요, 엄마. 이건 얼마예요?"],
				["It’s 50,000 won.", "50,000원이에요."],
				["Oh, it’s too expensive.", "오, 너무 비싸요."],
				["Hello. I’m looking for a hairpin.", "안녕하세요. 저는 머리핀을 찾고 있어요."],
				["How about this one?", "이건 어떠세요?"],
				["Oh, it’s cute.", "오, 귀여워요."],
				["I want two, please. How much are they?", "두 개 주세요. 얼마예요?"],
				["They’re 800 won.", "800원이에요."],
				["This is for you.", "이건 엄마를 위한 것이에요."],
				["Thank you. I love it.", "고마워. 마음에 들어."]
			],
		},
		data_123_s_1_a: { // 파일명 - Look and Listen(1)
			subtitle: [
				[0.5, 2.3, 1],
				[2.5, 9.1, 2],
				[9.3, 12.8, 3],
				[13.0, 16.2, 2],
				[16.5, 19.0, 1],
				[19.3, 22.2, 2],
				[22.5, 26.5, 2],
				[26.7, 28.5, 4],
				[29.0, 34.8, 2],
				[35.1, 37.2, 4],
				[37.6, 39.5, 2],
				[40.0, 42.8, 3]
			]
		},

		////////////
		// P - 12
		data_p124_01: { // 파일명 -
			subtitle: [ // 자막싱크([시작시간, 끝시간, 역할번호])
				[3.7, 6.1, 1],
				[6.2, 10.3, 2],
				[10.7, 12.5, 2],
				[12.7, 16.2, 1],
				[16.5, 20.5, 2],
				[23.7, 25, 3],
				[25.2, 29, 2],
				[29.4, 32.2, 2],
				[32.5, 34.4, 3],
				[34.7, 35.5, 2],
				[40.6, 42.1, 4],
				[42.4, 46, 1],
				[47.5, 49.2, 4],
				[49.5, 52.5, 1],
				[53, 55, 4],
				[60.5, 63.3, 2],
				[64.5, 66, 2],
				[66.1, 68.1, "1_2_5"],
				[68.3, 70.5, 1],
				[71.8, 74.5, 6]
			],
			dialogue: [
				["Today is Dad’s birthday.", "오늘은 아빠의 생신이야."],
				["Right. I want to make a strawberry cake for Dad.", "맞아. 나는 아빠를 위해 딸기 케이크를 만들고 싶어."],
				["He likes strawberries.", "아빠는 딸기를 좋아하셔."],
				["Umm... I want to buy socks for him.", "음··· 나는 아빠를 위해 양말을 사고 싶어."],
				["Good idea. Let’s go shopping together.", "좋은 생각이야. 쇼핑하러 가자."],
				["May I help you?", "도와드릴까요?"],
				["Yes, please. I’m looking for some strawberries.", "네. 저는 딸기를 찾고 있어요."],
				["I like these. How much are they?", "이게 좋겠네요. 얼마예요?"],
				["They’re 4,000 won.", "4,000원이에요."],
				["Okay.", "네."],
				["May I help you?", "도와드릴까요?"],
				["Yes, please. I’m looking for socks.", "네. 저는 양말을 찾고 있어요."],
				["How about these?", "이건 어떠세요?"],
				["Nice! How much are they?", "좋아요! 얼마예요?"],
				["They’re 900 won.", "900원이에요."],
				["Dad, close your eyes, please.", "아빠, 눈을 감아 주세요."],
				["Open your eyes!", "눈을 떠 주세요!"],
				["Happy birthday!", "생일 축하합니다!"],
				["This is for you, Dad.", "이건 아빠를 위한 것이에요."],
				["Thanks, Rachel. I love them.", "고마워, Rachel. 마음에 들어."]
			],
		},
		data_p124_02: { // 파일명 -
			subtitle: [ // 자막싱크([시작시간, 끝시간, 역할번호])
				[1.6, 4.4, 1],
				[8.5, 16.5, 1],
				[17.5, 20, 1],
				[20.5, 25.7, 1],
				[29.5, 32.4, 1],
				[33.2, 37.5, 1],
				[38.4, 44.2, 1],
				[48.4, 51.4, 1],
				[52, 55.5, 1],
				[56.1, 64.3, 1],
				[68, 71, 1],
				[71.6, 82, 1],
				[82.7, 90.6, 1],
				[92.5, 96.5, 1],
				[97.2, 99.6, 1]
			],
			dialogue: [
				["", "세계의 다양한 화폐 단위"],
				["", "이야기에서 Alex와 Rachel은 아빠의 생신 선물을 사는 데 4,000원과 900원을 썼어요."],
				["", "‘원’은 우리나라의 화폐 단위예요."],
				["", "그렇다면 다른 나라의 화폐 단위는 무엇인지 알아볼까요?"],
				["", "‘달러’는 미국의 화폐 단위예요."],
				["", "달러는 세계에서 가장 널리 사용되는 화폐이기도 해요."],
				["", "최초의 은화를 ‘탈러’라고 부른 것에서 ‘달러’가 유래되었어요."],
				["", "‘위안’은 중국의 화폐 단위예요."],
				["", "중국어로 ‘위안’은 ‘둥글다’는 뜻이에요."],
				["", "지폐 앞면에는 모두 중화인민공화국을 세운 마오쩌둥의 초상화가 그려져 있답니다."],
				["", "‘파운드’는 영국의 화폐 단위예요."],
				["", "파운드는 과거 영국에서 은의 질량을 무게 단위인 파운드로 측정하여 화폐로 사용하던 것에서 유래되었다고 해요.", -10],
				["", "지폐와 동전의 앞면에는 모두 영국의 ‘엘리자베스 2세’ 여왕의 초상화가 그려져 있어요."],
				["", "여러분은 유럽 연합의 유로를 알고 있나요?"],
				["", "인터넷으로 더 찾아보세요."]
			],
		},
		data_124_s_1_a: { // 파일명 - Look and Say(1)
			subtitle: [
				[0.5, 3.3, 1],
				[3.5, 10.0, 2],
				[10.7, 14.5, 1],
				[14.8, 18.1, 2],
				[18.5, 20.0, 3],
				[20.2, 27.2, 2],
				[27.5, 30.0, 3],
				[30.5, 31.5, 2],
				[32.0, 33.5, 4],
				[34.5, 38.5, 1],
				[39.0, 41.0, 4],
				[41.5, 45.0, 1],
				[45.5, 48.0, 4],
				[48.7, 54.5, 2],
				[54.6, 57.0, "1_2_5"],
				[57.5, 60.5, 1],
				[60.7, 63.6, 6]
			]
		},

		////////////
		// P - 13
		data_125_s_1_f: { // 파일명 - Think and Talk
			subtitle: [
				[0.5, 2.5],
				[3.0, 6.5],
				[7.0, 9.5],
				[9.8, 13.7],
				[14.0, 16.5],
				[17.0, 18.5],
				[19.2, 23.0],
				[23.7, 25.6],
				[26.3, 29.8],
				[30.0, 33.0],
				[33.5, 35.3],
				[35.7, 40.2],
				[40.8, 42.7],
				[43.4, 46.7],
				[47.4, 49.7],
				[50.0, 51.7],
				[52.4, 57.0],
				[57.2, 59.3],
				[60.0, 63.2],
				[64.0, 66.0],
				[66.6, 68.1],
				[69.0, 73.3],
				[74.0, 76.0],
				[76.5, 80.0],
				[80.5, 82.6],
				[83.0, 84.7],
				[85.4, 89.6],
				[90.0, 92.0],
				[92.5, 96.0],
				[96.5, 99.2]
			]
		},

		////////////
		// P - 126
		data_p126_01: { // data_ + sync ID : 012_01_a_01
			subtitle: [
				[9, 11, 1],
				[11.1, 15.2, 2],
				[15.5, 17.5, 1],
				[18.5, 21.4, 2],
				[23, 25, 1],
				[28.6, 30.5, 3],
				[30.7, 35, 2],
				[35.2, 37.1, 3],
				[38.1, 41.1, 2],
				[42.3, 44.6, 3],
				[57, 59, 4],
				[59.2, 63.3, 2],
				[63.5, 65.5, 4],
				[66.5, 69.4, 2],
				[70.7, 73, 4],
				[76.5, 78.6, 5],
				[78.7, 83, 2],
				[83.2, 85.1, 5],
				[86.2, 89.3, 2],
				[90.5, 92.6, 5]
			],
			dialogue: [
				['May I help you?', '도와드릴까요?'],
				['Yes, please. I’m looking for a dress.', '네. 저는 드레스를 찾고 있어요.'],
				['How about this one?', '이건 어떠세요?'],
				['I like it. How much is it?', '마음에 들어요. 얼마예요?'],
				['It’s ten thousand won.', '10,000원이에요.'],
				['May I help you?', '도와드릴까요?'],
				['Yes, please. I’m looking for socks.', '네. 저는 양말을 찾고 있어요.'],
				['How about these?', '이건 어떠세요?'],
				['I like them. How much are they?', '마음에 들어요. 얼마예요?'],
				['They’re eight hundred won.', '800원이에요.'],
				['May I help you?', '도와드릴까요?'],
				['Yes, please. I’m looking for a hairpin.', '네. 저는 머리핀을 찾고 있어요.'],
				['How about this one?', '이건 어떠세요?'],
				['I like it. How much is it?', '마음에 들어요. 얼마예요?'],
				['It’s two hundred won.', '200원이에요.'],
				['May I help you?', '도와드릴까요?'],
				['Yes, please. I’m looking for jeans.', '네. 저는 청바지를 찾고 있어요.'],
				['How about these?', '이건 어떠세요?'],
				['I like them. How much are they?', '마음에 들어요. 얼마예요?'],
				['They’re nine thousand won.', '9,000원이에요.']
			]
		},
		data_p126_01_follow: { // 따라하기파일적용 테스트 용
	        subtitle: [
				[8.8, 13.6, 1],
				[13.7, 21.8, 2],
				[22.1, 26.7, 1],
				[27.6, 33.9, 2],
				[35.5, 39.7, 1],
				[43.3, 47.5, 3],
				[47.6, 56.3, 2],
				[56.4, 60.3, 3],
				[61.3, 68.3, 2],
				[69.5, 74.7, 3],
				[86.9, 91.7, 4],
				[91.8, 100.3, 2],
				[100.5, 105.2, 4],
				[105.8, 112.3, 2],
				[113.6, 117.9, 4],
				[121.4, 125.8, 5],
				[125.9, 134.5, 2],
				[134.6, 138.6, 5],
				[139.7, 146.7, 2],
				[148.1, 153.7, 5]
	        ],
	        dialogue: [
				['May I help you?', '도와드릴까요?'],
				['Yes, please. I’m looking for a dress.', '네. 저는 드레스를 찾고 있어요.'],
				['How about this one?', '이건 어떠세요?'],
				['I like it. How much is it?', '마음에 들어요. 얼마예요?'],
				['It’s ten thousand won.', '10,000원이에요.'],
				['May I help you?', '도와드릴까요?'],
				['Yes, please. I’m looking for socks.', '네. 저는 양말을 찾고 있어요.'],
				['How about these?', '이건 어떠세요?'],
				['I like them. How much are they?', '마음에 들어요. 얼마예요?'],
				['They’re eight hundred won.', '800원이에요.'],
				['May I help you?', '도와드릴까요?'],
				['Yes, please. I’m looking for a hairpin.', '네. 저는 머리핀을 찾고 있어요.'],
				['How about this one?', '이건 어떠세요?'],
				['I like it. How much is it?', '마음에 들어요. 얼마예요?'],
				['It’s two hundred won.', '200원이에요.'],
				['May I help you?', '도와드릴까요?'],
				['Yes, please. I’m looking for jeans.', '네. 저는 청바지를 찾고 있어요.'],
				['How about these?', '이건 어떠세요?'],
				['I like them. How much are they?', '마음에 들어요. 얼마예요?'],
				['They’re nine thousand won.', '9,000원이에요.']
	        ]
		},
		data_126_s_1_a: { // 파일멸 - Sing and Read
			subtitle: [
				[0.5, 2.0, 1],
				[3.0, 6.5, 1],
				[7.5, 9.5, 1],
				[10.5, 14.0, 1],
				[14.3, 17.0, 1],
				[17.3, 19.0, 1],
				[20.0, 23.5, 1],
				[24.5, 26.0, 1],
				[27.0, 30.5, 1],
				[31.0, 33.5, 1],
				[34.0, 36.0, 1],
				[36.5, 40.5, 1],
				[41.0, 43.5, 1],
				[44.0, 47.0, 1],
				[48.0, 50.0, 1],
				[50.5, 52.5, 1],
				[53.0, 57.0, 1],
				[57.2, 59.5, 1],
				[60.0, 63.5, 1],
				[64.0, 66.5, 1]
			]
		},
		data_126_s_2_a: { // 파일멸 - Sing and Read
			subtitle: [
				[0.5, 2.0, 1],
				[3.0, 6.5, 1],
				[7.5, 9.5, 1],
				[10.5, 14.0, 1],
				[14.3, 17.0, 1],
				[17.3, 19.0, 1],
				[20.0, 23.5, 1],
				[24.5, 26.0, 1],
				[27.0, 30.5, 1],
				[31.0, 33.5, 1],
				[34.0, 36.0, 1],
				[36.1, 38.0, 1],
				[38.5, 40.0, 1],
				[40.5, 42.5, 1]
			]
		},
		data_126_o_38_a: { // 파일멸 - Sing and Read
			subtitle: [
				[0.2, 2.0, 1],
				[2.5, 6.0, 2],
				[6.5, 9.0, 3],
				[9.5, 11.5, 3],
				[12.0, 14.5, 4]
			]
		},

		////////////
		// P - 15
		data_15_o_2_a: { // 파일명 - Write It
			subtitle: [
				[0.3, 2.0, 1],
				[2.5, 6.0, 2],
				[6.5, 9.0, 3],
				[9.5, 11.5, 3],
				[12.0, 14.5, 4]
			]
		},
		data_127_o_10_a: { // 파일명 - Write It
			subtitle: [
				[0.3, 2.0, 1],
				[2.5, 6.0, 2],
				[6.5, 9.0, 3],
				[9.5, 11.5, 3],
				[12.0, 14.5, 4]
			]
		},

		////////////
		// P - 128
		data_128_s_13_f: { // 파일명 - Let's Read(전체 듣기)
			subtitle: [
				[0.4,	3.8],
				[4.0,	7.8],
				[8.1,	10.5],
				[11.0,	14.5],
				[15.0,	17.5],
				[18.0,	20.5],
				[21.0,	23.0],
				[23.5,	26.0],
				[26.5,	29.0],
				[29.2,	32.0],
				[32.2,	35.45],
				[35.6,	38.45],
				[38.6,	41.5],
				[41.7,	44.8],
				[45.0,	47.0],
				[47.5,	50.0]
			]
		},
		data_128_o_4_a: { // 파일명 - Let's Read(읽기 1)
			subtitle: [
				[0.4, 3.8, 1],
				[4.0, 8.0, 1],
				[8.1, 10.5, 2],
				[11.0, 14.5, 2],
				[15.0, 17.5, 2],
				[18.0, 20.5, 2],
				[21.0, 23.0, 2],
				[23.5, 26.0, 2],
				[26.5, 29.0, 2]
			]
		},
		data_16_o_6_a: { // 파일명 - Let's Read(읽기 1)
			subtitle: [
				[0.7, 3.0, 1],
				[3.5, 6.0, 1],
				[6.5, 9.5, 1],
				[10.0, 12.7, 1],
				[13.2, 16.0, 1]
			]
		},
		data_129_o_1_a: { // 파일명 - Let's Read(읽기 1)
			subtitle: [
				[0.5, 3.0, 1],
				[3.5, 6.5, 1],
				[6.8, 9.5, 1],
				[9.8, 12.5, 1],
				[13.0, 16.0, 1],
				[16.1, 18.5, 1],
				[18.6, 21.3, 1]
			]
		},

		////////////
		// P - 129
		data_129_s_1_a: { // 파일명 - 창의문항
			subtitle: [
				[0.5, 2.5, 1],
				[3.0, 7.0, 2],
				[7.5, 10.5, 1],
				[11.0, 15.0, 2],
				[15.5, 18.0, 1],
				[18.5, 21.0, 2],
				[21.5, 25.5, 1],
				[26.0, 29.5, 2],
				[30.0, 34.0, 1],
				[34.5, 37.0, 2]
			]
		},

		////////////
		// P - 18
		data_130_o_2_a: { // Step 1(Soccer Club)
			subtitle: [
				[0.5, 2.5, 1],
				[3.0, 8.3, 1],
				[8.8, 11.5, 1],
				[12.0, 14.0, 1],
				[14.5, 17.0, 2],
				[17.5, 20.0, 1]
			]
		},

		////////////
		// P - 19
		data_131_o_1_a: { // 파일명 - Step 4
			subtitle: [
				[0.5, 2.5, 1],
				[2.7, 6.5, 2],
				[7.0, 9.0, 1],
				[9.5, 13.0, 2],
				[13.2, 15.5, 1],
				[16.5, 21.0, 3],
				[21.5, 24.0, 4]
			]
		},

		////////////
		// P - 20
		data_132_o_2_f: { // 파일명 - Review(A)
			subtitle: [
				[0.5,	5.0],
				[5.5,	7.5],
				[8.0,	10.0],
				[10.5,	14.5],
				[15.0,	16.7],
				[17.0,	21.0],
				[21.5,	23.5],
				[24.0,	27.0],
				[28.0,	30.5]
			]
		},
		data_132_o_11_a: { // 파일명 - Review(B)
			subtitle: [
				[0.3, 4.4, 1],
				[5.0, 7.4, 2],
				[8.0, 11.5, 3],
				[12.0, 17.0, 4],
				[17.5, 20.5, 3],
				[21.0, 23.1, 2],
				[23.5, 27.0, 1],
				[27.6, 29.5, 2],
				[30.0, 33.5, 1],
				[34.0, 36.5, 2]
			]
		},
		data_132_o_30_a: { // 파일명 - Review(C)
			subtitle: [
				[0.2, 1.8, 1],
				[2.5, 6.0, 2],
				[6.5, 8.5, 1],
				[9.0, 12.5, 2],
				[13.0, 15.5, 1]
			]
		},
		data_133_o_1_a: { // 파일명 - Review(D)
			subtitle: [
				[0.5, 2.5, 1],
				[3.0, 6.8, 2],
				[7.0, 9.0, 1],
				[9.5, 12.0, 2],
				[12.5, 15.0, 1]
			]
		},

		////////////
		// P - 21
		data_133_o_6_f: { // 파일명 - Review(E1)
			subtitle: [
				[0.3,	2.0],
				[2.5,	6.0],
				[6.5,	8.5],
				[9.0,	11.5]
			]
		},
		data_133_o_6_a: { // 파일명 - Review(E1)
			subtitle: [
				[0.3, 2.0, 1],
				[2.5, 6.0, 2]
			]
		},
		data_133_o_8_a: { // 파일명 - Review(E2)
			subtitle: [
				[0.3, 2.0, 3],
				[2.5, 5.0, 4]
			]
		},
		data_133_o_12_a: { // 파일명 - Try More
			subtitle: [
				[0.2, 4.2, 1],
				[4.5, 6.7, 2]
			]
		},
	}
});
